{
    "recipes": [
      {
        "id": 1,
        "title": "Spicy tuna pasta",
        "type": "Savory",
        "ingredients": [
          "300g Pasta of choice",
          "250g chopped tomatoes (canned)",
          "100ml heavy cream",
          "220g tuna in brine",
          "70g Parmesan Cheese",
          "1/2 large onion",
          "Juice of 1/4 lemon",
          "Greens, to sprinkle on top",
          "Chilli flakes",
          "Oregano",
          "Salt",
          "Pepper"
        ],
        "instructions": "Heat oil in a pan over the medium heat, add there chopped onion and cook until soft. Add chopped tomatoes and heavy cream, stir to combine. Boil the wate an one it's boild add the pasta and cook as directed on a pack. Add spices to the sauce - chili flakes, oregano, pepper and salt. Add parmesan cheese and tuna, stril until it's combine. Add the drained-cooked pasta to the tuna mixture. Drizzle with the lemon juice and sprinkle the greens on the top. Enjoy!",
        "imageURL": "/Users/livaieleja/Desktop/Kursi - RCS/JAVA/rcs_java/Final/Images/SpicyTunaPasta.jpg"
      },
      {
        "id": 2,
        "title": "Golden Roasted Chicken with Herbed Potatoes",
        "type": "Savory",
        "ingredients": [
          "7 chicken legs",
          "5 potatoes, cut into chunks",
          "3 sweet potatoes, cut into chunks",
          "1 onion, sliced",
          "1/2 cup lemon juice",
          "3/4 cup extra virgin olive oil",
          "1 tablespoon dried oregano",
          "1 teaspoon chili flakes",
          "Salt and pepper",
          "3/4 cup chicken broth"
        ],
        "instructions": "Preheat the oven to 180°C (356°F). In a large baking tray, combine the chicken legs, potato chunks, sweet potato chunks, and sliced onion. In a bowl, whisk together the lemon juice, extra virgin olive oil, dried oregano, chili flakes, salt, pepper, and chicken broth until well combined. Pour the sauce evenly over the chicken and potatoes in the tray, ensuring everything is well coated. Cover the tray tightly with aluminum foil and bake in the preheated oven for approximately 1 and a half hours. Remove the aluminum foil, and with a spoon, gently sprinkle the juices from the tray over the chicken and potatoes to add moisture and flavor. Continue cooking until the chicken and potatoes are golden brown and fully cooked, achieving a crispy exterior and a tender, flavorful interior. Once golden and cooked through, remove from the oven. Let it rest for a few minutes before serving to allow the flavors to meld together beautifully.",
        "imageURL": "/Users/livaieleja/Desktop/Kursi - RCS/JAVA/rcs_java/Final/Images/GoldenRoastedChicken.jpg"
      },
      {
        "id": 3,
        "title": "Cheesecake",
        "type": "Sweet",
        "ingredients": [
          "200g cookies",
          "5 tbsp grape seeds oil",
          "400g Philadelphia light cream cheese",
          "400g Greek yogurt",
          "2 eggs",
          "15g stevia powder",
          "Juice of 1/2 lemon",
          "Vanilla extract (to taste)",
          "Berries for serving"
        ],
        "instructions": "Preheat the oven to 180C. Grind the cookies in a blender, in a bowl mix them with oil. Put the cookie mixture is baking tray and press it with a spoon. Mix well all other ingredients, you can use a mixer. Pour the cheese mixture over the cookies and put the oven for 30 minutes. Then reduce the temperature to 110 C and bake the cake again for 40 minutes. Serve cooled with berries.",
        "imageURL": "/Users/livaieleja/Desktop/Kursi - RCS/JAVA/rcs_java/Final/Images/Cheesecake.jpg"
      }
    ]
  }